---
kind: method
id: M:Autodesk.Revit.DB.Architecture.Railing.Reset
zh: 栏杆
source: html/fc09d693-e4f2-8971-cb2d-b64cd6325227.htm
---
# Autodesk.Revit.DB.Architecture.Railing.Reset Method

**中文**: 栏杆

Resets the railing to the default one that the system generates.

## Syntax (C#)
```csharp
public void Reset()
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - Cannot reset the railing.